// УП-практикум, спец.Информатика, 6-та група, Седмица 3
// Примери за работа с побитови операции
#include <iostream>
using namespace std;

int main(){
  // Нека за целите на примера изберем числата 5 и 4.
  // Двоичният им запис е както следва (ще използваме само 5 бита, макар и истинското им представяне да е с 16):
  // 5 -> 00101
  // 4 -> 00100
  int x = 5, y = 4;

  // Нека разгледаме една по една побитовите операции и тяхното действие:
  
  // Операцията &:
  //  00101 & 00100 -> 00100 (4)
  cout << "x&y = " << (x&y) << "\n";

  // Операцията |:
  x = 5;
  // 00101 | 00100 -> 00101 (5)
  cout << "x|y = " << (x|y) << "\n";

  // Операцията ^:
  x = 5;
  // 00101 ^ 00100 -> 00001 (1)
  cout << "x^y = " << (x^y) << "\n";

  // Операцията ~:
  x = 5;
  // ~00101 -> 1...11010 (-6) , ... защото записа на числото е 16 бита а не 5, както е дадено за примера
  cout << "~x = " << (~x) << "\n";

  // Операцията <<:
  x = 5;
  // 00101 << 2 -> 10100 (20)
  cout << "x<<2 = " << (x<<2) << "\n";

  // Операцията >>:
  x = 5;
  // 00101 >> 2 -> 00001 (1)
  cout << "x>>2 = " << (x>>2) << "\n";
  
  return 0;
}
