// УП-практикум, спец.Информатика, 6-та група, Седмица 3
#include <iostream>
#include <math.h>
using namespace std;

int main(){
  int x;
  cout << "x=";
  cin  >> x;

  // За да разберем какъв е размера на даден тип или променлива x,
  // използваме sizeof(x), a за да разберем колко бита има
  // едно число от този тип трябва да повдигнем 2 на размера байтове,
  // чрез pow(2, sizeof(x)):
  int size_x = pow(2, sizeof(x));

  // Нека x=5, двоичното му представяне е 0101:
  // Итерираме битовете на числото използвайки <<, като започнем
  // от най-дясна 0-лева позиция. Чрез оператора & проверяваме дали бита
  // на тази позиция е 1:
  // При i=0:
  //     1<<0 -> 0001; Имаме 0101 & 0001 -> 0001 != 0 => бита на позиция 0 в 5 е 1
  // При i=1:
  //     1<<1 -> 0010; Имаме 0101 & 0010 -> 0000 == 0 => бита на позиция 1 в 5 е 0
  // При i=2:
  //     1<<2 -> 0100; Имаме 0101 & 0100 -> 0100 != 0 => бита на позиция 2 в 5 е 0

  cout << "Set bits at positions: ";
  for(int i=0; i < size_x; i++) {
    if (x & (1<<i)) {
      cout << i << " ";
    }
  }
  cout << "\n";
  
  return 0;
}
